import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

const state = {
      films: [
        {
          cover: "/images/p1606727862.png",
          title: "千与千寻",
          director: "宫崎骏",
          description:
            "千寻和爸爸妈妈一同驱车前往新家，在郊外的小路上不慎进入了神秘的隧道——他们去到了另外一个诡异世界—一个中世纪的小镇。远处飘来食物的香味，爸爸妈妈大快朵颐，孰料之后变成了猪！这时小镇上渐渐来了许多样子古怪、半透明的人。千寻仓皇逃出，一个叫小白的人救了他，喂了她阻止身体消 失的药，并且告诉她怎样去找锅炉爷爷以及汤婆婆，而且必须获得一份工作才能不被魔法变成别的东西。"
        },
        {
          cover: "/images/p1222295277.png",
          title: "哈尔的移动城堡",
          director: "宫崎骏",
          description:
            "继母因无力负担生活，将苏菲和她的两个妹妹都送到了制帽店去当学徒。两个妹妹很快先后就离开了制帽店去追寻各自的梦想，只有苏菲坚持了下来。一天，小镇旁边来了一座移动堡垒，传说堡垒的主人哈尔专吸取年青姑娘的灵魂，所以小镇的姑娘都不敢靠近。一个恶毒的巫婆为了报复苏菲与哈尔见面，用巫术把她变成了一个80岁的老太婆，而且苏菲还不能对别人说出自己身中的巫术。无奈，苏菲决定独自一人逃离小镇。天黑了，虚弱的苏菲没走多远，来到了移动城堡。心想自己已经是老太婆了，苏菲壮着胆子走进了城堡。不想，遇到了和她遭遇相同的火焰魔。两人约定彼此帮助对方打破各自的咒语……"
        },
        {
          cover: "/images/p456676352.png",
          title: "魔女宅急便",
          director: "宫崎骏",
          description:
            "琪琪今年13岁了，按照魔法界的规矩，魔法少女年满13岁就要出外进行为期一年的修行。所以琪琪带着宠物黑猫吉吉踏上了修行之旅。然而，修行之旅开始得并不顺利，当琪琪来到海边一座大城市时，人们并没有欢迎她的到来，人人都不搭理她。幸亏琪琪有一颗善良的心，当她拾到了一件别人的失物时，热心的琪琪找到了失主。她的善良赢得了面包店老板娘的好感，琪琪就在面包店开始了她用飞行魔法为客人服务的快递业务。琪琪很快适应了新环境，一次，一个热衷于飞机制造的男孩邀请琪琪去参加飞行俱乐部的聚会，途中琪琪因为帮一位老大娘送东西而被雨淋了。从此，琪琪突然发现自己的魔法正在一天天变弱。"
        },
        {
          cover: "/images/p1446261379.png",
          title: "天空之城",
          director: "宫崎骏",
          description:
            "在过去的历史之中，传说着曾有人类以高科技创造了可飞行于天空的城市 －拉普达。虽多数认为这是虚构幻想出来的事物，但仍有相信飞行城市存在而试图寻找出的人们。某一日晚上，搭载众多旅客的飞行客船突遭到空中海盗团的袭击和入侵，空中海盗的目标是搭乘飞行船的一位名叫希达的少女身上所携带与飞行城市传说相关的物品“飞行石”。巴斯与希达为了抢回飞行石并阻止罗穆斯卡的企图，于是搭上了朵拉一族的飞行船一同前往拉普达——传说的天空之城。"
        },
        {
          cover: "/images/p454118602.png",
          title: "悬崖上的金鱼姬",
          director: "宫崎骏",
          description:
            "金鱼姬是一条活泼好动的小鱼，一次偶然的机会，它在涨潮时被冲进了玻璃瓶中无法脱身。此时，刚好来海边度假的男孩宗介路过，帮它解困，从此人鱼相识。宗介把金鱼抱回家里喂养，一起玩耍，感情甚笃。由于海员父亲终日出航，宗介只得跟母亲相依为命，这让他的性格孤僻自闭，甚至对长辈也不理不睬。但是，遇到金鱼姬后，宗介逐渐改变了对生活的冷漠态度，这也让他慢慢修复了性格中的缺陷。一次意外的海啸中，宗介撞伤了身体，金鱼姬沾染到了人类的血，飘回了大海之中。原来海洋中还有另外一个世界，那里有个操控水文环境的古怪男子藤本，因为发现了人类污染环境的丑陋，所以自造了另一个水中世界。他发现金鱼姬沾染了人气，正准备用魔法将它打回原形，却事与愿违……"
        },
        {
          cover: "/images/p2540924496.png",
          title: "龙猫",
          director: "宫崎骏",
          description:
            "小月的母亲生病住院了，父亲带着她与四岁的妹妹小梅到乡间的居住。她们对那里的环境都感到十分新奇，也发现了很多有趣的事情。她们遇到了很多小精灵，她们来到属于她们的环境中，看到了她们世界中很多的奇怪事物，更与一只大大胖胖的龙猫成为了朋友。龙猫与小精灵们利用他们的神奇力量，为小月与妹妹带来了很多神奇的景观，令她们大开眼界。妹妹小梅常常挂念生病中的母亲，嚷着要姐姐带着她去看母亲，但小月拒绝了。小梅竟然自己前往，不料途中迷路了，小月只好寻找她的龙猫及小精灵朋友们帮助。"
        }
      ]
}

export default new Vuex.Store({
  state
})
